       IDENTIFICATION DIVISION.
       PROGRAM-ID. GENERATE-INVENTORY-REPORT.
       AUTHOR. CAN SHI.
       
       ENVIRONMENT DIVISION.
       INPUT-OUTPUT SECTION.
       FILE-CONTROL.
           SELECT INVENTORY-FILE-IN ASSIGN TO 'INVENT01.TXT'
           ORGANIZATION IS LINE SEQUENTIAL
           ACCESS IS SEQUENTIAL.
           SELECT OPTIONAL INVENTORY-REPORT-OUT ASSIGN TO 'INVREPRT.TXT'
           ORGANIZATION IS LINE SEQUENTIAL
           ACCESS IS SEQUENTIAL.
           
       DATA DIVISION.
       FILE SECTION.
       FD INVENTORY-FILE-IN.
       01 RECORD-IN.
           05 PART-NUMBER PIC 9(5).
           05 PART-NAME PIC X(20).
           05 QUANTITY-ON-HAND PIC 9(3).
           05 UNIT-PRICE PIC 9(4).
           05 SUPPLIER-CODE PIC X(5).
           05 RE-ORDER-POINT PIC 9(3).
       FD INVENTORY-REPORT-OUT.
       01 REPORT-CONTENT PIC X(50).

       WORKING-STORAGE SECTION.
       01 INDICATORS.
           05 EOF PIC X(3) VALUE "NO ".
           05 READ-COUNTER PIC 9(5) VALUE 0.
           05 WRITE-COUNTER PIC 9(5) VALUE 0.
       01 REPORT-HEADER.
           05 FILLER PIC X(18) VALUE SPACES.
           05 FILLER PIC X(16) VALUE "INVENTORY REPORT".
           05 FILLER PIC X(16) VALUE SPACES.
       01 COLUMN-HEADER.
           05 FILLER PIC X VALUE SPACE.
           05 FILLER PIC X(6) VALUE "NUMBER".
           05 FILLER PIC X VALUE SPACE.
           05 FILLER PIC X(8) VALUE "PARTNAME".
           05 FILLER PIC X(17) VALUE SPACES.
           05 FILLER PIC X(3) VALUE "QTY".
           05 FILLER PIC X(3) VALUE SPACES.
           05 FILLER PIC X(5) VALUE "VALUE".
           05 FILLER PIC X(6) VALUE SPACES.
           
       01 RECORD-LINE.
           05 FILLER PIC X VALUE SPACE.
           05 PART-NUMBER-WS PIC ZZZZ9.
           05 FILLER PIC X(2) VALUE SPACES.
           05 PART-NAME-WS PIC X(20).
           05 FILLER PIC X(5) VALUE SPACES.
           05 QUANTITY-ON-HAND-WS PIC 9(3).
           05 FILLER PIC X(3) VALUE SPACES.
           05 ITEM-VALUE-WS PIC 9(7).
           05 FILLER PIC X(4) VALUE SPACES.

       05 TOTAL-VALUE-WS PIC 9(10).

       01 TOTAL-VALUE-LINE.
           05 FILLER PIC X VALUE SPACES.
           05 FILLER PIC X(10) VALUE "TOTALVALUE".
           05 FILLER PIC X(2) VALUE SPACES.
           05 TOTAL-VALUE-DISPLAY PIC $,$$$,$$$,$$9.

       01 RECORDS-READ-LINE.
           05 FILLER PIC X VALUE SPACES.
           05 FILLER PIC X(7) VALUE "RECORDS".
           05 FILLER PIC X(1) VALUE SPACES.
           05 FILLER PIC X(4) VALUE "READ".
           05 FILLER PIC X(4) VALUE SPACES.
           05 RECORDS-READ-WS PIC 9(5).
           
       01 RECORDS-WRITTEN-LINE.
           05 FILLER PIC X VALUE SPACES.
           05 FILLER PIC X(7) VALUE "RECORDS".
           05 FILLER PIC X VALUE SPACES.
           05 FILLER PIC X(7) VALUE "WRITTEN".
           05 FILLER PIC X VALUE SPACE.
           05 RECORDS-WRITTEN-WS PIC 9(5).

       PROCEDURE DIVISION.
       
       100-CREATE-INVENTORY-REPORT.
           PERFORM 201-INITIATE-CREATE-INVENTORY-REPORT.
           PERFORM 202-CREATE-INVENTORY-RECORD UNTIL EOF = "YES".
           PERFORM 203-TERMINATE-CREATE-INVENTORY-REPORT.
           STOP RUN.
           
       201-INITIATE-CREATE-INVENTORY-REPORT.
           PERFORM 301-OPEN-INVENTORY-FILE-IN.
           PERFORM 302-OPEN-INVENTORY-REPORT-OUT.
           PERFORM 303-WRITE-REPORT-HEADER.
           PERFORM 304-READ-RECORD.
       
       202-CREATE-INVENTORY-RECORD.
           PERFORM 308-CALCULATE-ITEM-VALUE.
           PERFORM 309-ADD-VALUE-TO-TOTAL.
           PERFORM 310-WRITE-TO-INVENTORY-REPORT-OUT.
           PERFORM 304-READ-RECORD.
       
       203-TERMINATE-CREATE-INVENTORY-REPORT.
           PERFORM 305-CREATE-REPORT-ENDING.
           PERFORM 306-CLOSE-INVENTORY-FILE-IN.
           PERFORM 307-CLOSE-INVENTORY-REPORT-OUT.
       
       301-OPEN-INVENTORY-FILE-IN.
           OPEN INPUT INVENTORY-FILE-IN.
       
       302-OPEN-INVENTORY-REPORT-OUT.
           OPEN OUTPUT INVENTORY-REPORT-OUT.
       
       303-WRITE-REPORT-HEADER.
           WRITE REPORT-CONTENT FROM REPORT-HEADER
               BEFORE ADVANCING 2 LINES.
           WRITE REPORT-CONTENT FROM COLUMN-HEADER
               BEFORE ADVANCING 2 LINES.
       
       304-READ-RECORD.
           READ INVENTORY-FILE-IN
               AT END MOVE "YES" TO EOF
                   NOT AT END ADD 1 TO READ-COUNTER.
               
       305-CREATE-REPORT-ENDING.
           PERFORM 401-WRITE-TOTAL-VALUE-TO-REPORT-OUT.
           PERFORM 402-WRITE-NUMBER-OF-RECORD-READ.
           PERFORM 403-WRITE-NUMBER-OF-RECORD-WRITTEN.
       
       306-CLOSE-INVENTORY-FILE-IN.
           CLOSE INVENTORY-FILE-IN.
       
       307-CLOSE-INVENTORY-REPORT-OUT.
           CLOSE INVENTORY-REPORT-OUT.
       
       308-CALCULATE-ITEM-VALUE.
           COMPUTE ITEM-VALUE-WS = QUANTITY-ON-HAND * UNIT-PRICE.
       
       309-ADD-VALUE-TO-TOTAL.
           COMPUTE TOTAL-VALUE-WS = TOTAL-VALUE-WS + ITEM-VALUE-WS.
       
       310-WRITE-TO-INVENTORY-REPORT-OUT.
           MOVE PART-NUMBER TO PART-NUMBER-WS.
           MOVE PART-NAME TO PART-NAME-WS.
           MOVE QUANTITY-ON-HAND TO QUANTITY-ON-HAND-WS.
           WRITE REPORT-CONTENT FROM RECORD-LINE.
           ADD 1 TO WRITE-COUNTER.
           
       401-WRITE-TOTAL-VALUE-TO-REPORT-OUT.
           MOVE TOTAL-VALUE-WS TO TOTAL-VALUE-DISPLAY.
           WRITE REPORT-CONTENT FROM TOTAL-VALUE-LINE 
               AFTER ADVANCING 1 LINES.
       
       402-WRITE-NUMBER-OF-RECORD-READ.
           MOVE READ-COUNTER TO RECORDS-READ-WS.
           WRITE REPORT-CONTENT FROM RECORDS-READ-LINE
               AFTER ADVANCING 2 LINES.
       
       403-WRITE-NUMBER-OF-RECORD-WRITTEN.
           MOVE WRITE-COUNTER TO RECORDS-WRITTEN-WS.
           WRITE REPORT-CONTENT FROM RECORDS-WRITTEN-LINE.

       
